recipe = {
    "ingredients": [
        {
            "product": {
                "id": 170,
                "name": "Яйцо куриное",
                "category": "Молоко, сыр, яйца",
            },
            "quantity": 12.0,
            "unit": "шт.",
        },
        {
            "product": {"id": 63, "name": "Горчица", "category": "Бакалея, соусы"},
            "quantity": 2.0,
            "unit": "ст. ложка",
        },
        {
            "product": {"id": 176, "name": "Майонез", "category": "Молоко, сыр, яйца"},
            "quantity": 2.0,
            "unit": "ст. ложка",
        },
        {
            "product": {
                "id": 340,
                "name": "Сок лимонный (или овощной рассол)",
                "category": "Овощи и фрукты",
            },
            "quantity": 2.0,
            "unit": "ст. ложка",
        },
        {
            "product": {"id": 41, "name": "Соль", "category": "Бакалея, соусы"},
            "quantity": 1.0,
            "unit": "по вкусу",
        },
        {
            "product": {
                "id": 341,
                "name": "Перец черный молотый",
                "category": "Бакалея, соусы",
            },
            "quantity": 1.0,
            "unit": "по вкусу",
        },
        {
            "product": {
                "id": 342,
                "name": "Паприка молотая",
                "category": "Бакалея, соусы",
            },
            "quantity": 1.0,
            "unit": "по вкусу",
        },
        {
            "product": {"id": 343, "name": "Лук зеленый", "category": "Овощи и фрукты"},
            "quantity": 1.0,
            "unit": "по вкусу",
        },
    ],
    "description": [
        {"text": "Яйца отварить вкрутую (8-10 минут) и остудить в холодной воде."},
        {"text": "Охлажденные яйца очистить и разрезать вдоль на половинки."},
        {
            "text": "Аккуратно достать из половинок желтки, выложить в миску и размять вилкой."
        },
        {
            "text": "Добавить к желткам соль, перец, горчицу, майонез и лимонный сок или рассол. Хорошо перемешать."
        },
        {"text": "Наполнить яичные белки приготовленной начинкой из желтков."},
        {
            "text": "Посыпать фаршированные яйца паприкой и нарезанным зеленым луком. Закуска готова."
        },
    ],
    "id": 14,
    "name": "Пикантные фаршированные яйца",
    "category": "Закуски",
    "cooking_time": "10",
    "created_at": "2023-08-03T19:25:18.793912",
}
