recipes = [
    {
        "name": "Пикантные фаршированные яйца",
        "category": "Закуски",
        "description": """
        1. Яйца отварить вкрутую (8-10 минут) и остудить в холодной воде.<br>
        2. Охлажденные яйца очистить и разрезать вдоль на половинки.<br>
        3. Аккуратно достать из половинок желтки, выложить в миску и размять вилкой.<br>
        4. Добавить к желткам соль, перец, горчицу, майонез и лимонный сок или рассол. Хорошо перемешать.<br>
        5. Наполнить яичные белки приготовленной начинкой из желтков.<br>
        6. Посыпать фаршированные яйца паприкой и нарезанным зеленым луком. Закуска готова.
        """,
        "preparation_time": "10",
        "cooking_time": "10",
        "ingredients": [
            {
                "product": {"name": "Яйца", "category": "Молоко, сыр, яйца"},
                "quantity": 12,
                "unit": "шт.",
            },
            {
                "product": {"name": "Горчица", "category": "Бакалея, соусы"},
                "quantity": 2,
                "unit": "ст. ложка",
            },
            {
                "product": {"name": "Майонез", "category": "Бакалея, соусы"},
                "quantity": 2,
                "unit": "ст. ложка",
            },
            {
                "product": {
                    "name": "Сок лимонный (или овощной рассол)",
                    "category": "Овощи и фрукты",
                },
                "quantity": 2,
                "unit": "ст. ложка",
            },
            {
                "product": {"name": "Соль", "category": "Бакалея, соусы"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {
                    "name": "Перец черный молотый",
                    "category": "Бакалея, соусы",
                },
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Паприка молотая", "category": "Бакалея, соусы"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Лук зеленый", "category": "Овощи и фрукты"},
                "quantity": 1,
                "unit": "по вкусу",
            },
        ],
    },
    {
        "name": "Шоколадно-апельсиновый кекс с орехами",
        "category": "Выпечка",
        "description": """
        1. Подготовить продукты.<br>
        2. Разбить яйца в емкость и хорошо взбить миксером. Постепенно добавить сахар, при этом продолжая взбивать.<br>
        3. Добавить размягченное сливочное масло и взбить. Миксер больше не понадобится.<br>
        4. Просеять муку и разрыхлитель - перемешать, чтобы не было комочков.<br>
        5. Готовое тесто разделить на две равные части.<br>
        6. В одну часть добавляем какао и измельченные грецкие орехи -перемешиваем в однородную массу.<br>
        7. Цедру апельсина натереть на мелкой терке и выжать сок. Цедру и сок отправляем во вторую половину нашего теста - перемешиваем.<br>
        9. Форму для выпекания застилаем пергаментной бумагой и смазываем ее растительным маслом. Выкладываем слой теста с добавлением какао, распределяя ровным слоем по всей поверхности. Сверху выкладываем слой теста с апельсином.<br>
        10. Выпекаем наш кекс в духовке, разогретой на 200 градусов в течение 40 минут.<br>
        11. Остывший кекс разрезаем на кусочки и украшаем сахарной пудрой.<br>
        Приятного чаепития!
""",
        "preparation_time": "20",
        "cooking_time": "40",
        "ingredients": [
            {
                "product": {"name": "Мука", "category": "Бакалея, соусы"},
                "quantity": 200,
                "unit": "г",
            },
            {
                "product": {
                    "name": "Масло сливочное",
                    "category": "Молоко, сыр, яйца",
                },
                "quantity": 200,
                "unit": "г",
            },
            {
                "product": {"name": "Сахар", "category": "Бакалея, соусы"},
                "quantity": 200,
                "unit": "г",
            },
            {
                "product": {"name": "Яйца", "category": "Мясо, птица"},
                "quantity": 5,
                "unit": "шт.",
            },
            {
                "product": {"name": "Апельсин", "category": "Овощи и фрукты"},
                "quantity": 1,
                "unit": "шт.",
            },
            {
                "product": {"name": "Какао-порошок", "category": "Бакалея, соусы"},
                "quantity": 2,
                "unit": "ст. ложка",
            },
            {
                "product": {
                    "name": "Разрыхлитель для теста",
                    "category": "Бакалея, соусы",
                },
                "quantity": 10,
                "unit": "г",
            },
            {
                "product": {"name": "Сахарная пудра", "category": "Бакалея, соусы"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Орехи грецкие", "category": "Овощи и фрукты"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Масло растительное", "category": "Бакалея, соусы"},
                "quantity": 1,
                "unit": "по вкусу",
            },
        ],
    },
    {
        "name": "Тыквенный крем-суп",
        "category": "Первые блюда",
        "description": """
                    1. В кастрюле разогреть масло и обжарить в нем в течение 1 минуты измельчённый чеснок.<br>
                    2. Затем добавить измельченную луковицу и жарить ещё 5-6 минут.<br>
                    3. Тыкву порезать на небольшие кубики и добавить в кастрюлю. Обжаривать все ещё минут 5.<br>
                    4. Залить все водой, довести до кипения и варить на среднем огне 10-12 минут.<br>
                    5. Когда тыква сварится измельчить все блендером до однородного состояния и снова довести до кипения.<br>
                    6. Влить сливки, добавить соль, перец, мускатный орех и держать на маленьком огне минуты 3-4.<br>
                    7. Накрыть кастрюлю крышкой и дать супу постоять ещё минут 10-15.<br>
                    8. Подавать с подсушенным багетом, посыпав суп тыквенными семечками.
                    """,
        "preparation_time": "10",
        "cooking_time": "30",
        "ingredients": [
            {
                "product": {"name": "Тыква", "category": "Овощи и фрукты"},
                "quantity": 700,
                "unit": "г",
            },
            {
                "product": {"name": "Лук", "category": "Овощи и фрукты"},
                "quantity": 1,
                "unit": "шт.",
            },
            {
                "product": {"name": "Сливки 10%", "category": "Молоко, сыр, яйца"},
                "quantity": 200,
                "unit": "мл",
            },
            {
                "product": {"name": "Чеснок", "category": "Овощи и фрукты"},
                "quantity": 1,
                "unit": "зубчик",
            },
            {
                "product": {"name": "Соль", "category": "Бакалея, соусы"},
                "quantity": 1,
                "unit": "ч. ложка",
            },
            {
                "product": {"name": "Перец чёрный", "category": "Бакалея, соусы"},
                "quantity": 0.5,
                "unit": "ч. ложка",
            },
            {
                "product": {"name": "Мускатный орех", "category": "Бакалея, соусы"},
                "quantity": 0.5,
                "unit": "ч. ложка",
            },
            {
                "product": {"name": "Масло оливковое", "category": "Бакалея, соусы"},
                "quantity": 3,
                "unit": "ст. ложка",
            },
            {
                "product": {"name": "Тыквенные семечки", "category": "Бакалея, соусы"},
                "quantity": 50,
                "unit": "г",
            },
        ],
    },
    {
        "name": "Оливье",
        "category": "Салаты",
        "description": """
        1. Картофель и морковь вымойте щеткой и отварите в подсоленной воде до готовности. 
        Яйца отварите отдельно, не допуская переваривания желтка. 
        Очистите и нарежьте кубиками со стороной 5 мм. Такими же кубиками нарежьте ветчину.<br>
        2. Смешайте все ингредиенты в салатнике, добавьте мелко нарезанный зеленый лук и укроп. 
        Приправьте черным перцем, заправьте майонезом и поставьте в холодильник.<br>
        3. Если соленые огурцы с крупными семенами - удалите их. 
        Затем нарежьте кубиками такого же размера. Сложите в отдельный контейнер. 
        Слейте жидкость с горошка, горошек переложите в отдельный контейнер.<br>
        4. Перед подачей на стол добавьте в салат соленые огурцы и зеленый горошек. 
        Еще раз перемешайте салат, попробуйте и при необходимости добавьте соль и черный перец.
        """,
        "preparation_time": "0",
        "cooking_time": "90",
        "ingredients": [
            {
                "product": {"name": "Картофель", "category": "Овощи и фрукты"},
                "quantity": 3,
                "unit": "шт.",
            },
            {
                "product": {"name": "Морковь", "category": "Овощи и фрукты"},
                "quantity": 3,
                "unit": "шт.",
            },
            {
                "product": {"name": "Яйца", "category": "Молоко, сыр, яйца"},
                "quantity": 4,
                "unit": "шт.",
            },
            {
                "product": {
                    "name": "Консервированный зелёный горошек",
                    "category": "Консервы, мёд, варенье",
                },
                "quantity": 450,
                "unit": "г",
            },
            {
                "product": {
                    "name": "Солёные огурцы",
                    "category": "Консервы, мёд, варенье",
                },
                "quantity": 5,
                "unit": "шт.",
            },
            {
                "product": {
                    "name": "Ветчина",
                    "category": "Сосиски, колбасы, деликатесы",
                },
                "quantity": 350,
                "unit": "г",
            },
            {
                "product": {
                    "name": "Зелёный лук",
                    "category": "Овощи и фрукты",
                },
                "quantity": 5,
                "unit": "шт.",
            },
            {
                "product": {
                    "name": "Укроп",
                    "category": "Овощи и фрукты",
                },
                "quantity": 1,
                "unit": "шт.",
            },
            {
                "product": {
                    "name": "Майонез",
                    "category": "Бакалея, соусы",
                },
                "quantity": 250,
                "unit": "г",
            },
            {
                "product": {
                    "name": "Соль",
                    "category": "Бакалея, соусы",
                },
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {
                    "name": "Перец",
                    "category": "Бакалея, соусы",
                },
                "quantity": 1,
                "unit": "по вкусу",
            },
        ],
    },
]
