recipes = [
    {
        "name": "Пикантные фаршированные яйца",
        "category": "Закуски",
        "description": """1. Яйца отварить вкрутую (8-10 минут) и остудить в холодной воде.
2. Охлажденные яйца очистить и разрезать вдоль на половинки.
3. Аккуратно достать из половинок желтки, выложить в миску и размять вилкой.
4. Добавить к желткам соль, перец, горчицу, майонез и лимонный сок или рассол. Хорошо перемешать.
5. Наполнить яичные белки приготовленной начинкой из желтков.
6. Посыпать фаршированные яйца паприкой и нарезанным зеленым луком. Закуска готова.""",
        "preparation_time": "10",
        "cooking_time": "10",
        "ingredients": [
            {
                "product": {"name": "Яйца", "category": "Мясные товары"},
                "quantity": 12,
                "unit": "шт",
            },
            {
                "product": {"name": "Горчица", "category": "Бакалея"},
                "quantity": 2,
                "unit": "столовая ложка",
            },
            {
                "product": {"name": "Майонез", "category": "Бакалея"},
                "quantity": 2,
                "unit": "столовая ложка",
            },
            {
                "product": {
                    "name": "Сок лимонный (или овощной рассол)",
                    "category": "Овощи-фрукты",
                },
                "quantity": 2,
                "unit": "столовая ложка",
            },
            {
                "product": {"name": "Соль", "category": "Бакалея"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Перец черный молотый", "category": "Бакалея"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Паприка молотая", "category": "Бакалея"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Лук зеленый", "category": "Овощи-фрукты"},
                "quantity": 1,
                "unit": "по вкусу",
            },
        ],
    },
    {
        "name": "Шоколадно-апельсиновый кекс с орехами",
        "category": "Выпечка",
        "description": """Подготовить продукты.
Разбить яйца в емкость и хорошо взбить миксером. Постепенно добавить сахар, при этом продолжая взбивать.
Добавить размягченное сливочное масло и взбить. Миксер больше не понадобится.
Просеять муку и разрыхлитель - перемешать, чтобы не было комочков.
Готовое тесто разделить на две равные части.
В одну часть добавляем какао и измельченные грецкие орехи -перемешиваем в однородную массу.
Цедру апельсина натереть на мелкой терке и выжать сок. Цедру и сок отправляем во вторую половину нашего теста - перемешиваем.
Форму для выпекания застилаем пергаментной бумагой и смазываем ее растительным маслом. Выкладываем слой теста с добавлением какао, распределяя ровным слоем по всей поверхности. Сверху выкладываем слой теста с апельсином.
Выпекаем наш кекс в духовке, разогретой на 200 градусов в течение 40 минут.
Остывший кекс разрезаем на кусочки и украшаем сахарной пудрой.
Приятного чаепития!
""",
        "preparation_time": "20",
        "cooking_time": "40",
        "ingredients": [
            {
                "product": {"name": "Мука", "category": "Бакалея"},
                "quantity": 200,
                "unit": "г",
            },
            {
                "product": {
                    "name": "Масло сливочное",
                    "category": "Молочная продукция",
                },
                "quantity": 200,
                "unit": "г",
            },
            {
                "product": {"name": "Сахар", "category": "Бакалея"},
                "quantity": 200,
                "unit": "г",
            },
            {
                "product": {"name": "Яйца", "category": "Мясные товары"},
                "quantity": 5,
                "unit": "шт",
            },
            {
                "product": {"name": "Апельсин", "category": "Овощи-фрукты"},
                "quantity": 1,
                "unit": "шт",
            },
            {
                "product": {"name": "Какао-порошок", "category": "Бакалея"},
                "quantity": 2,
                "unit": "столовая ложка",
            },
            {
                "product": {"name": "Разрыхлитель для теста", "category": "Бакалея"},
                "quantity": 10,
                "unit": "г",
            },
            {
                "product": {"name": "Сахарная пудра", "category": "Бакалея"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Орехи грецкие", "category": "Овощи-фрукты"},
                "quantity": 1,
                "unit": "по вкусу",
            },
            {
                "product": {"name": "Масло растительное", "category": "Бакалея"},
                "quantity": 1,
                "unit": "по вкусу",
            },
        ],
    },
]
